# ภาคเหนือ
north_region = [
    "เชียงใหม่", "เชียงราย", "ลำพูน", "ลำปาง", 
    "แพร่", "น่าน", "พะเยา", "แม่ฮ่องสอน", "อุตรดิตถ์", "สุโขทัย", "พิษณุโลก", "พิจิตร", "กำแพงเพชร", "ตาก"
]

# ภาคตะวันออกเฉียงเหนือ
northeast_region = [
    "อุบลราชธานี", "อุดรธานี", "บุรีรัมย์", "สุรินทร์", 
    "ขอนแก่น", "มหาสารคาม", "ร้อยเอ็ด", "นครราชสีมา", 
    "ชัยภูมิ", "สกลนคร", "หนองคาย", "หนองบัวลำภู", 
    "นครพนม", "ยโสธร", "มุกดาหาร", "ศรีสะเกษ", 
    "เลย", "บึงกาฬ", "อำนาจเจริญ", "กาฬสินธุ์"
]

# ภาคกลาง
central_region = [
    "กรุงเทพมหานคร", "สมุทรปราการ", "นนทบุรี", "ปทุมธานี", 
    "พระนครศรีอยุธยา", "ลพบุรี", "สระบุรี", "นครนายก", 
    "อ่างทอง", "สิงห์บุรี", "ชัยนาท", "อุทัยธานี", 
    "สุพรรณบุรี", "นครปฐม", "สมุทรสาคร", 
    "สมุทรสงคราม"
]

# ภาคตะวันออก
eastern_region = [
    "ชลบุรี", "ระยอง", "จันทบุรี", "ตราด", 
    "ฉะเชิงเทรา", "ปราจีนบุรี", "สระแก้ว", "นครนายก"
]

# ภาคตะวันตก
western_region = [
    "กาญจนบุรี", "ราชบุรี", "เพชรบุรี", 
    "ประจวบคีรีขันธ์"
]

# ภาคใต้
southern_region = [
    "นครศรีธรรมราช", "สุราษฎร์ธานี", "กระบี่", "ตรัง", 
    "พัทลุง", "สงขลา", "สตูล", "ปัตตานี", 
    "ยะลา", "นราธิวาส", "ภูเก็ต", "พังงา", 
    "ระนอง", "ชุมพร"
]